Table of Contents
 Class ReferenceElement
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Reference element class
public class ReferenceElement
Inheritance
object
ReferenceElement
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReferenceElement()
Constructor
public ReferenceElement()
 ReferenceElement(OpenElementId)
Constructor
public ReferenceElement(OpenElementId element)
Parameters
element OpenElementId
Referenced element
Properties
 Element
Referenced element
public OpenElementId Element { get; set; }
Property Value
OpenElementId
 Id
Element Id
public int Id { get; set; }
Property Value
int
 TypeName
Element type name
public string TypeName { get; set; }
Property Value
string
 Edit this page